Show / Hide Table of Contents
Class ResultOfInternalForces
Result of internal forces in the one position
Inheritance
System.Object
SectionResultBase
ResultOfInternalForces
Inherited Members
 SectionResultBase.Loading
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class ResultOfInternalForces : SectionResultBase
Remarks
Convention of internal forces on 1D members
 Internal forces on 1D members perform following actions:
 • positive bending moment My causes tension in cross-section fibers with negative z-coordinate
 • positive bending moment Mz causes tension in fibers with negative y-coordinate
 • positive torsional moment Mx acts about x-axis of 1D member
 • positive axial force N acts in direction of x-axis of member and causes tension in cross-section fibers
 • positive shear force Qz acts in direction of z-axis of cross-section
 • positive shear force Qy acts in direction of y-axis of cross-section
Constructors
Improve this Doc   View Source
ResultOfInternalForces()
Constructor
Declaration
public ResultOfInternalForces()
Properties
Improve this Doc   View Source
Mx
Bending moment around x-axis
Declaration
public double Mx { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
My
Bending moment around y-axis
Declaration
public double My { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Mz
Bending moment around z-axis
Declaration
public double Mz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
N
Normal force
Declaration
public double N { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Qy
Shear force in y dirrection
Declaration
public double Qy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Qz
Shear force in z dirrection
Declaration
public double Qz { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source